# 机器学习 - 百分位数
# 什么是百分位数？
# 统计学中使用百分位数（Percentiles）为您提供一个数字，该数字描述了给定百分比值小于的值。
# 例如：假设我们有一个数组，包含住在一条街上的人的年龄。
# ages = [5,31,43,48,50,41,7,11,15,39,80,82,32,2,8,6,25,36,27,61,31]
# 什么是 75 百分位数？答案是 43，这意味着 75％ 的人是 43 岁或以下。
# NumPy 模块有一种用于找到指定百分位数的方法：

import numpy
ages = [5,31,43,48,50,41,7,11,15,39,80,82,32,2,8,6,25,36,27,61,31]
x = numpy.percentile(ages, 75)
print(x)
#使用 NumPy percentile() 方法查找百分位数

import numpy
ages = [5,31,43,48,50,41,7,11,15,39,80,82,32,2,8,6,25,36,27,61,31]
x = numpy.percentile(ages, 90)
print(x)
#90％ 的人口年龄是多少岁？